print('Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк..')

a = input('Вставьте первое слово: ')

b = input('вставьте первую букву: ')

c = input('всавьте второе слово: ')

d = input('Вставьте вторую букву: ')

e = input('Вставьте третье слово: ')

f = input('Вставьте четвёртое слово: ')

g = input('вставьте третью букву: ')

print(f'Шляпка гриба, покрытая {a} кожиц{b}й, держится на {c} ножк{d}. Снизу шляпка затянута {e} плёнкой. Когда её уберёшь, откроется нижняя {f} сторона шляпк{g}.') # здесь безумно важный f список так что не забудь!!!!!!!!!!!!1!1!!!!!!!
